cases/square2D_VIV_multiprocessing/env04/0/U_0
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "10";
    object      U_0;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
18474
(
(2.0000511 -0.00037001441 0)
(2.0000008 -0.00065185 0)
(2.0000253 -0.00072074084 0)
(2.0000029 -0.0008689156 0)
(2.0000138 -0.00094554423 0)
(2.0000045 -0.0010428818 0)
(2.0000078 -0.0011077819 0)
(2.0000035 -0.0011722076 0)
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (2 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    syms
    {
        type            zeroGradient;
    }
    front1
    {
        type            incrementalJetUniVelocity;
        alpha           0.2;
        t0              0;
        deltaT          0.0005;
        v0              (0 0 0);
        v1              (0 0 0);
        value           uniform (0 0 0);
    }
    front2
    {
        type            incrementalJetUniVelocity;
        alpha           0.2;
        t0              0;
        deltaT          0.0005;
        v0              (0 0 0);
        v1              (0 0 0);
        value           uniform (0 0 0);
    }
    middle1
    {
        type            incrementalJetUniVelocity;
        alpha           0.2;
        t0              0;
        deltaT          0.0005;
        v0              (0 0 0);
        v1              (0 0 0);
        value           uniform (0 0 0);
    }
    middle2
    {
        type            incrementalJetUniVelocity;
        alpha           0.2;
        t0              0;
        deltaT          0.0005;
        v0              (0 0 0);
        v1              (0 0 0);
        value           uniform (0 0 0);
    }
    back1
    {
        type            incrementalJetUniVelocity;
        alpha           0.2;
        t0              0;
        deltaT          0.0005;
        v0              (0 0 0);
        v1              (0 0 0);
        value           uniform (0 0 0);
    }
    back2
    {
        type            incrementalJetUniVelocity;
        alpha           0.2;
        t0              0;
        deltaT          0.0005;
        v0              (0 0 0);
        v1              (0 0 0);
        value           uniform (0 0 0);
    }
    cylinder
    {
        type            movingWallVelocity;
        value           nonuniform List<vector> 
128
(
(1.9593826e-08 0.43174889 -1.3242136e-33)
(0 0.43174889 0)
(0 0.43174889 0)
(0 0.43174889 0)
(0 0.43174889 0)
(0 0.43174889 0)
(0 0.43174889 0)
(0 0.43174889 0)
...
)
;
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
